---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceX
source: html/273f6a08-248c-aedb-b115-e36eba06388c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemPatternIntermediateDistanceX Property

"Intermediate distance on side 1"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemPatternIntermediateDistanceX { get; }
```